{"Notes/Pharma/Active-Pharmaceutical-Ingredient":{"title":"Active Pharmaceutical Ingredient","links":["Notes/Pharma/Primary-Manufacturing","Notes/Pharma/Secondary-Manufacturing"],"tags":[],"content":"Active Pharmaceutical Ingredient, commonly known as API is the key part of a drug, this is made during the Primary Manufacturing process and used as part of the Secondary Manufacturing process."},"Notes/Pharma/Assembly":{"title":"Assembly","links":["Notes/Pharma/Autoinjectors","Force-Distance"],"tags":[],"content":"Assembly is the process of assembling a device, for injectable devices this this is commonly Autoinjectors. Assembly can be a very complex process due to many complex parts that can have no visual indication of correct installation.\nFor example for many devices require monitoring of Force-Distance to check correct assembly which can be vary depending on the device tolerances."},"Notes/Pharma/Autoinjectors":{"title":"Autoinjectors","links":["Notes/Pharma/Vials","Notes/Pharma/Secondary-Manufacturing","Notes/Pharma/Assembly","Notes/Pharma/Syringes","Housing","Notes/Pharma/Power-Pack"],"tags":[],"content":"An autoinjector is a type of single use device used to deliver drugs to a patient. These devices are designed to be simple so that complex medicines that previously would require a healthcare professional to administer, such as Vials products, can be self administered saving time of both the healthcare team and patient.\nAutoinjectors however require the added Secondary Manufacturing complexities of Assembly.\nAutoinjectors are made up of:\n\nSyringes\nHousing\nPower Pack\n"},"Notes/Pharma/Beads":{"title":"Beads","links":["Notes/Pharma/Wet-Bead-Mill","Notes/Pharma/Milling"],"tags":[],"content":"Beads are small balls used in Wet Bead Mill to erode the product. These are commonly made using ceramic material due to their hardness.\nBead sizing determines the effective Milling particulate size."},"Notes/Pharma/Body":{"title":"Body","links":["Notes/Pharma/Syringes","Notes/Pharma/Bulk-Drug-Product","Stopper","Notes/Pharma/Needle"],"tags":[],"content":"The body of Syringes, commonly know as the Barrel, is the glass section of a syringe that contains the liquid Bulk Drug Product and Stopper and also mounts into the Needle directly."},"Notes/Pharma/Buffer":{"title":"Buffer","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Bulk-Drug-Product"],"tags":[],"content":"Buffer is typically the non Active Pharmaceutical Ingredient components of Bulk Drug Product, these ingredients don’t have a biological impact but are instead used to support the API such as for Stability, Solubility and Efficacy."},"Notes/Pharma/Bulk-Drug-Product":{"title":"Bulk Drug Product","links":["Filling","Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Buffer","Notes/Pharma/Bulk-Drug-Substance"],"tags":[],"content":"Bulk Drug Product or commonly BDS is the name for product that is fully made ready for Filling. This is made up of the Active Pharmaceutical Ingredient and any Buffer required for the product. This name is typically used in conjunction with Bulk Drug Substance to define the product before and after manufacturing."},"Notes/Pharma/Bulk-Drug-Substance":{"title":"Bulk Drug Substance","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Bulk-Drug-Substance"],"tags":[],"content":"BDS or Bulk Drug Substance is typically another name for Active Pharmaceutical Ingredient, it is the drug product before it has been made up into Bulk Drug Substance."},"Notes/Pharma/Cold-chain":{"title":"Cold chain","links":["Critical-Process-Parameter","RFID","RTLS"],"tags":[],"content":"Cold chain products are products where temperature plays a role in the stability of the product. As such the duration the products are out of a cold storage must be tracked as a Critical Process Parameter. This is commonly implemented as a manual check but in more digital factories entry and exit events are tracked through RFID or RTLS systems."},"Notes/Pharma/Depyrogenation-Oven":{"title":"Depyrogenation Oven","links":["Sterilisation","Dry-Heat","Notes/Pharma/pyrogens"],"tags":[],"content":"A depyrogenation oven is a piece of equipment used for Sterilisation which uses Dry Heat. A depyrogenation oven not only kills bacteria but also destroys pyrogens. A depyrogenation oven typically has a few operations:\n\n?Venting? - Start heating with vents open to remove moisture\nHeating - Continue heating with vents closed to reach depyrogenation temperature\nDelay - Hold chamber at depyrogenation temperature until whole load is at depyrogenation temperature\nDepyrogenation - Hold depyrogenation temperature until whole load has experienced depyrogenation duration\nCooling - Cool load down to prevent injury once the door is opened\n"},"Notes/Pharma/Dispensing":{"title":"Dispensing","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Buffer","Notes/Pharma/Beads"],"tags":[],"content":"Dispensing is the process of measuring key quantities of materials for production of the product, commonly Active Pharmaceutical Ingredient, Buffer, Beads etc…"},"Notes/Pharma/Endotoxins":{"title":"Endotoxins","links":["Gram-Negative-Bacteria","Notes/Pharma/pyrogens","Sterilisation"],"tags":[],"content":"Endotoxins are sections of outer wall of Gram-Negative Bacteria which are pyrogens. Endotoxins are typically generated as part of Sterilisation where bacteria is broken down leaving the cell wall endotoxins behind."},"Notes/Pharma/Forced-Thaw":{"title":"Forced Thaw","links":["Notes/Pharma/Thawing","Notes/Pharma/Active-Pharmaceutical-Ingredient"],"tags":[],"content":"Forced thawing is a controlled process for melting/Thawing Active Pharmaceutical Ingredient, typically a bag of product is lightly clamped between two metal plates, these metal plates are lightly heated usually through a liquid acting as a heat exchanger for the product. This allows more control and reproducibility over the thawing of a product."},"Notes/Pharma/Formulation":{"title":"Formulation","links":["Notes/Pharma/Buffer","Notes/Pharma/Manufacturing"],"tags":[],"content":"Formulation is the process in which Buffer is added during Manufacturing, this is usually done to ensure the product meets its requirements such as pH for stability."},"Notes/Pharma/Frozen-chicken":{"title":"Frozen chicken","links":["Notes/Pharma/Thawing","Notes/Pharma/Passive-Thaw","Notes/Pharma/Forced-Thaw"],"tags":[],"content":"To describe Thawing I commonly explain this like how someone may thaw a piece of chicken for dinner. If you have enough time you could leave the chicken out on a counter, this is like Passive Thaw otherwise if you were in a pinch and needed it soon you may choose to put it in a bath of warm water or on a metal plate to dissipate the heat quicker, this is similar to Forced Thaw."},"Notes/Pharma/Manufacturing":{"title":"Manufacturing","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Unit-Procedure","Notes/Pharma/Dispensing","Notes/Pharma/Thawing","Notes/Pharma/Pooling","Blending","Notes/Pharma/Formulation","Notes/Pharma/Milling","Granulation"],"tags":[],"content":"Manufacturing pharmaceutical products can change massively depending on the material properties of the Active Pharmaceutical Ingredient, some common manufacturing processes/Unit Procedures include:\n\nDispensing\nThawing\nPooling\nBlending\nFormulation\nMilling\nGranulation\n"},"Notes/Pharma/Milling":{"title":"Milling","links":["Notes/Pharma/Wet-Bead-Mill"],"tags":[],"content":"Milling is a process for reducing the particle size of products, milling can either be wet or dry. For wet milling the most common method is Wet Bead Milling.\n?Dry milling?"},"Notes/Pharma/Needle":{"title":"Needle","links":["Notes/Pharma/Syringes","Notes/Pharma/Body","Needle-Shield"],"tags":[],"content":"The needle of Syringes, is a hollow metal tube connected to the Body that is used to inject into the body. Before use a needle will have some level of Needle Shield to protect the needle from both sterility issues and physical damage."},"Notes/Pharma/Passive-Thaw":{"title":"Passive Thaw","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient"],"tags":[],"content":"Passive thawing is the process of leaving Active Pharmaceutical Ingredient in an ambient area to let it slowly thaw, as this is’t forced or controlled outside of the ambient areas controls this can take a good amount of time depending on the thermal mass and surface area, it also leads to variance in terms of time to thaw so checks have to be in place to ensure product is appropriately thawed."},"Notes/Pharma/Pharmaceutical-Manufacture":{"title":"Pharmaceutical Manufacture","links":["Notes/Pharma/Primary-Manufacturing","Notes/Pharma/Secondary-Manufacturing"],"tags":[],"content":"Pharma manufacturing chain is usually split into to distinct sections. Primary Manufacturing and Secondary Manufacturing."},"Notes/Pharma/Pooling":{"title":"Pooling","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Bulk-Drug-Product"],"tags":[],"content":"Pooling is the process of mixing multiple batches/bags of Active Pharmaceutical Ingredient together to create one batch of Bulk Drug Product"},"Notes/Pharma/Power-Pack":{"title":"Power Pack","links":["Notes/Pharma/Autoinjectors"],"tags":[],"content":"A power pack is a term used to describe the force acting part of Autoinjectors these powerpacks are the active part that allows the medicine to be delieved, as such the reliability of these devices must be high and ensure the drug is delivered in the right way."},"Notes/Pharma/Primary-Manufacturing":{"title":"Primary Manufacturing","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Secondary-Manufacturing"],"tags":[],"content":"Primary manufacturing in the pharma industry is the process of making the Active Pharmaceutical Ingredient, this API is then supplied to the Secondary Manufacturing process for finishing.\nNeed to talk here about primary processes"},"Notes/Pharma/Secondary-Manufacturing":{"title":"Secondary Manufacturing","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Bulk-Drug-Substance","Notes/Pharma/Vials","Notes/Pharma/Syringes","Dermatalogicals","Inhalations","Notes/Pharma/Manufacturing","Notes/Pharma/Bulk-Drug-Product","Filling","Lyophilization","Notes/Pharma/Assembly","Packing","Oral-Solid-Dose","Tablet-Pressing","Coating"],"tags":[],"content":"Secondary manufacturing, sometimes called Fill &amp; Finish in steriles, is the process of taking raw Active Pharmaceutical Ingredient or Bulk Drug Substance and transforming this into its final form ready for sale.\nFor liquid products (Vials, Syringes, Dermatalogicals and Inhalations) this is typically: Manufacturing a Bulk Drug Product,  Filling the product into its dose form such as Vials or Syringes, Lyophilization if required, Assembly if required, then Packing the product.\nFor Oral Solid Dose products this is typically: Manufacturing, Tablet Pressing, Coating, Packing."},"Notes/Pharma/Syringes":{"title":"Syringes","links":["Notes/Pharma/Vials","Notes/Pharma/Autoinjectors","aseptic","Terminal-Sterilisation","Stopper","Notes/Pharma/Body","Notes/Pharma/Needle","Needle-Shield"],"tags":[],"content":"Syringes are a dose form similar to Vials but with the needle attached directly for ease of use. Syringes are also commonly used in Autoinjectors. Syringes are almost always Sterile either directly filled under aseptic conditions or sterilised after filling throughTerminal Sterilisation.\nA syringe is typically made up of\n\nStopper\nBody\nNeedle\nNeedle Shield\n"},"Notes/Pharma/Thawing":{"title":"Thawing","links":["Notes/Pharma/Active-Pharmaceutical-Ingredient","Notes/Pharma/Manufacturing","Notes/Pharma/Cold-chain","Notes/Pharma/Frozen-chicken","Notes/Pharma/Forced-Thaw","Notes/Pharma/Passive-Thaw"],"tags":[],"content":"Product thawing is the process of un-freezing Active Pharmaceutical Ingredient ready for Manufacturing and is usually one of the first steps in the manufacturing process. Products that require thawing are usually Cold chain products. I usually use a Frozen chicken simile to describe the process. There are two main ways to that a product, Forced Thaw and Passive Thaw. Products that are thawed typically have a minimum thaw time before being allowed to be used."},"Notes/Pharma/Vials":{"title":"Vials","links":["aseptic","Terminal-Sterilisation","Lyophilization","Vial","Stopper","Cap"],"tags":[],"content":"Vials are a dose form commonly used for supply to healthcare professionals for delivery to the patient, vials are almost always Sterile either directly filled under aseptic conditions or sterilised after filling throughTerminal Sterilisation. Vials are also sometimes taken through a  Lyophilization process for drug stability before being made up at point of use especially for biologics or drugs that are unstable in liquid form.\nVials are typically made up of 3 main parts:\n\nVial\nStopper\nCap\n"},"Notes/Pharma/Wet-Bead-Mill":{"title":"Wet Bead Mill","links":["Notes/Pharma/Beads","Notes/Pharma/particle-size","Fluidised-Bed","Notes/Pharma/Depyrogenation-Oven","Unit-Procedure"],"tags":[],"content":"Wet bead mills use small Beads/balls to mill product down, the size of these beads determines the efficient particle size that the bead mill can create. In a sterile environment the sterility of these beads can be just as complex as the milling itself, requiring a method to clean and sterilise. Commonly using a Fluidised Bed, or other washer, and Depyrogenation Oven to achieve this.\nA wet bead mill, mills product by agitating the product with hard Beads effectively smashing the product down splitting it into smaller and smaller particles. A bead mill usually recirculates product around a larger tank to increase the amount of product milled in one Unit Procedure."},"Notes/Pharma/particle-size":{"title":"particle size","links":["Notes/Pharma/Milling","Granulation","Critical-Process-Parameter"],"tags":[],"content":"Particles size can be reduced through Milling and increased through Granulation to meet the product requirements.\nParticle size is usually a Critical Process Parameter and as such must be tested, particle size analysers are commonly placed inline in a process where possible allowing high levels of control and monitoring. For small particulate sizes though this can be complex and expensive and as such an offline test is still commonly used."},"Notes/Pharma/pyrogens":{"title":"pyrogens","links":["Notes/Pharma/Endotoxins"],"tags":[],"content":"Pyrogens are fever causing substances, in most cases in pharmaceuticals these are Endotoxins."},"index":{"title":"index","links":["Notes/Pharma/Secondary-Manufacturing"],"tags":[],"content":"Welcome to my website, I’ve made many generations of my website over the last few years and it’s always been sentimental to me, if not useful, to retain my old site for all, usually me, to go back and see. If you’re looking for my old website or are just interested in the history of the site you can find it here: hammie217.github.io/\nIn my newest site I’m trying out a new approach, trying to make a “Second Brain” style website where I can share my knowledge to anyone willing to listen. For now a central part of what I will be talking about is PharmaceuticalSecondary Manufacturing but I’m keen to expand the site into everything I deem important."}}